Autodesk.Revit.DB.LinePatternSegment.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.LinePatternSegment.Length
Gets and sets the length of the segment.
The length of the segment.

Autodesk.Revit.DB.LinePatternSegment.Type
Gets and sets the type of the segment.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.LinePatternSegment.#ctor(Autodesk.Revit.DB.LinePatternSegmentType,System.Double)
Creates a line pattern segment with given type and length.
type:
The segment type.
length:
The length.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.LinePatternSegment.#ctor
Creates a line pattern segment.

Autodesk.Revit.DB.LinePatternSegment
Represents a segment in a line pattern.